

// * создадим константу для списка типов игры
// * каждый элемент содержит название набора данных и подпись для кнопки
const GAME_TYPES = [
    { type: 'cats', text: 'Котики' },
    { type: 'flowers', text: 'Цветочки' },
    { type: 'cars', text: 'Машины' },
];
const AppRoute = {
    Initial: 'initial',
    Game: 'game',
    Results: 'results',
};

const TIMEOUT = 900;

// * настройка для функции генерации набора данных
// * используем последовательные данные для отладки и тестов
// * перемешиваем набор данных для усложнения игры
const RANDOMIZED = false;








